hacking/20230423223955-cloudflare.org
:PROPERTIES:
:ID:       34fa9a05-2476-401f-9c71-9040f735c527
:END:
#+TITLE: cloudflare
#+CREATED: [2023-04-23 Sun 22:39]
#+LAST_MODIFIED: [2023-04-23 Sun 23:03]
* Cloudflare
Cloudflare is a reverse proxy sites used to protect websites from ddos and bots.


** Bypasses
There are a number of ways to get around it depending on what your goal is.

*** TODO Put list here https://scrapeops.io/web-scraping-playbook/how-to-bypass-cloudflare/#scrape-with-fortified-headless-browsers
